espressif/esp-idf/components/soc/esp32h4/register/soc/efuse_reg.h
/** EFUSE_RD_REPEAT_DATA2_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA2_REG (DR_REG_EFUSE_BASE + 0x38)
/** EFUSE_XTS_DPA_PSEUDO_LEVEL : RO; bitpos: [1:0]; default: 0;
 *  Represents the pseudo round level of xts-aes anti-dpa attack.\\ 3: High.\\ 2:
 *  Moderate 1. Low\\ 0: Disabled\\
 */
#define EFUSE_XTS_DPA_PSEUDO_LEVEL    0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_M  (EFUSE_XTS_DPA_PSEUDO_LEVEL_V << EFUSE_XTS_DPA_PSEUDO_LEVEL_S)
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_V  0x00000003U
#define EFUSE_XTS_DPA_PSEUDO_LEVEL_S  0
/** EFUSE_XTS_DPA_CLK_ENABLE : RO; bitpos: [2]; default: 0;
 *  Represents whether xts-aes anti-dpa attack clock is enabled.\\ 1. Enable.\\ 0:
 *  Disable.\\
 */
#define EFUSE_XTS_DPA_CLK_ENABLE    (BIT(2))
#define EFUSE_XTS_DPA_CLK_ENABLE_M  (EFUSE_XTS_DPA_CLK_ENABLE_V << EFUSE_XTS_DPA_CLK_ENABLE_S)
#define EFUSE_XTS_DPA_CLK_ENABLE_V  0x00000001U
#define EFUSE_XTS_DPA_CLK_ENABLE_S  2
/** EFUSE_ECC_FORCE_CONST_TIME : RO; bitpos: [3]; default: 0;
 *  Represents whether to force ecc to use const-time calculation mode. \\ 1: Enable.
 *  \\ 0: Disable.
 */
#define EFUSE_ECC_FORCE_CONST_TIME    (BIT(3))
#define EFUSE_ECC_FORCE_CONST_TIME_M  (EFUSE_ECC_FORCE_CONST_TIME_V << EFUSE_ECC_FORCE_CONST_TIME_S)
#define EFUSE_ECC_FORCE_CONST_TIME_V  0x00000001U
#define EFUSE_ECC_FORCE_CONST_TIME_S  3
/** EFUSE_ECDSA_P384_ENABLE : RO; bitpos: [4]; default: 0;
 *  Represents if the chip supports ECDSA P384
 */
#define EFUSE_ECDSA_P384_ENABLE    (BIT(4))
#define EFUSE_ECDSA_P384_ENABLE_M  (EFUSE_ECDSA_P384_ENABLE_V << EFUSE_ECDSA_P384_ENABLE_S)
#define EFUSE_ECDSA_P384_ENABLE_V  0x00000001U
#define EFUSE_ECDSA_P384_ENABLE_S  4
/** EFUSE_SECURE_BOOT_EN : RO; bitpos: [5]; default: 0;
 *  Represents whether secure boot is enabled or disabled.\\ 1: enabled\\ 0: disabled\\
 */
#define EFUSE_SECURE_BOOT_EN    (BIT(5))
#define EFUSE_SECURE_BOOT_EN_M  (EFUSE_SECURE_BOOT_EN_V << EFUSE_SECURE_BOOT_EN_S)
#define EFUSE_SECURE_BOOT_EN_V  0x00000001U
#define EFUSE_SECURE_BOOT_EN_S  5
/** EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE : RO; bitpos: [6]; default: 0;
 *  Represents whether revoking aggressive secure boot is enabled or disabled.\\ 1:
 *  enabled.\\ 0: disabled\\
 */
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE    (BIT(6))
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_M  (EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V << EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S)
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_V  0x00000001U
#define EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE_S  6
/** EFUSE_KM_DISABLE_DEPLOY_MODE : RO; bitpos: [11:7]; default: 0;
 *  Represents whether the new key deployment of key manager is disabled. \\Bit0:
 *  Represents whether the new ECDSA key deployment is disabled\\0: Enabled\\1:
 *  Disabled\\Bit1: Represents whether the new XTS-AES (flash and PSRAM) key deployment
 *  is disabled\\0: Enabled\\1: Disabled\\Bit2: Represents whether the new HMAC key
 *  deployment is disabled\\0: Enabled\\1: Disabled\\Bit3: Represents whether the new
 *  DS key deployment is disabled\\0: Enabled\\1: Disabled\\
 */
#define EFUSE_KM_DISABLE_DEPLOY_MODE    0x0000001FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_M  (EFUSE_KM_DISABLE_DEPLOY_MODE_V << EFUSE_KM_DISABLE_DEPLOY_MODE_S)
#define EFUSE_KM_DISABLE_DEPLOY_MODE_V  0x0000001FU
#define EFUSE_KM_DISABLE_DEPLOY_MODE_S  7
/** EFUSE_KM_RND_SWITCH_CYCLE : RO; bitpos: [13:12]; default: 0;
 *  Represents the cycle at which the Key Manager switches random numbers.
 *  0: Controlled by the
 *  \hyperref[fielddesc:KEYMNGRNDSWITCHCYCLE]{KEYMNG\_RND\_SWITCH\_CYCLE} register. For
 *  more information, please refer to Chapter \ref{mod:keymng}
 *  \textit{\nameref{mod:keymng}}
 *  1: 8 Key Manager clock cycles
 *  2: 16 Key Manager clock cycles
 *  3: 32 Key Manager clock cycles
 */
#define EFUSE_KM_RND_SWITCH_CYCLE    0x00000003U
#define EFUSE_KM_RND_SWITCH_CYCLE_M  (EFUSE_KM_RND_SWITCH_CYCLE_V << EFUSE_KM_RND_SWITCH_CYCLE_S)
#define EFUSE_KM_RND_SWITCH_CYCLE_V  0x00000003U
#define EFUSE_KM_RND_SWITCH_CYCLE_S  12
/** EFUSE_KM_DEPLOY_ONLY_ONCE : RO; bitpos: [18:14]; default: 0;
 *  Represents whether the corresponding key can be deployed only once.
 *  Bit0: Represents whether the ECDSA key can be deployed only once
 *  0: The key can be deployed multiple times
 *  1: The key can be deployed only once
 *  Bit1: Represents whether the XTS-AES (flash and PSRAM) key can be deployed only once
 *  0: The key can be deployed multiple times
 *  1: The key can be deployed only once
 *  Bit2: Represents whether the HMAC key can be deployed only once
 *  0: The key can be deployed multiple times
 *  1: The key can be deployed only once
 *  Bit3: Represents whether the DS key can be deployed only once
 *  0: The key can be deployed multiple times
 *  1: The key can be deployed only once
 */
#define EFUSE_KM_DEPLOY_ONLY_ONCE    0x0000001FU
#define EFUSE_KM_DEPLOY_ONLY_ONCE_M  (EFUSE_KM_DEPLOY_ONLY_ONCE_V << EFUSE_KM_DEPLOY_ONLY_ONCE_S)
#define EFUSE_KM_DEPLOY_ONLY_ONCE_V  0x0000001FU
#define EFUSE_KM_DEPLOY_ONLY_ONCE_S  14
/** EFUSE_FORCE_USE_KEY_MANAGER_KEY : RO; bitpos: [23:19]; default: 0;
 *  Represents whether the corresponding key must come from Key Manager.
 *  Bit0: Represents whether the ECDSA key must come from Key Manager.
 *  0: The key does not need to come from Key Manager
 *  1: The key must come from Key Manager
 *  Bit1: Represents whether the XTS-AES (flash and PSRAM) key must come from Key
 *  Manager.
 *  0: The key does not need to come from Key Manager
 *  1: The key must come from Key Manager
 *  Bit2: Represents whether the HMAC key must come from Key Manager.
 *  0: The key does not need to come from Key Manager
 *  1: The key must come from Key Manager
 *  Bit3: Represents whether the DS key must come from Key Manager.
 *  0: The key does not need to come from Key Manager
 *  1: The key must come from Key Manager
 */
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY    0x0000001FU
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_M  (EFUSE_FORCE_USE_KEY_MANAGER_KEY_V << EFUSE_FORCE_USE_KEY_MANAGER_KEY_S)
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_V  0x0000001FU
#define EFUSE_FORCE_USE_KEY_MANAGER_KEY_S  19
/** EFUSE_FORCE_DISABLE_SW_INIT_KEY : RO; bitpos: [24]; default: 0;
 *  Represents whether to disable the use of the initialization key written by software
 *  and instead force use efuse\_init\_key.\\0: Enable\\1: Disable\\
 */
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY    (BIT(24))
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_M  (EFUSE_FORCE_DISABLE_SW_INIT_KEY_V << EFUSE_FORCE_DISABLE_SW_INIT_KEY_S)
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_V  0x00000001U
#define EFUSE_FORCE_DISABLE_SW_INIT_KEY_S  24
/** EFUSE_KM_XTS_KEY_LENGTH_256 : RO; bitpos: [25]; default: 0;
 *  Represents which key flash encryption uses.\\0: XTS-AES-256 key\\1: XTS-AES-128
 *  key\\
 */
#define EFUSE_KM_XTS_KEY_LENGTH_256    (BIT(25))
#define EFUSE_KM_XTS_KEY_LENGTH_256_M  (EFUSE_KM_XTS_KEY_LENGTH_256_V << EFUSE_KM_XTS_KEY_LENGTH_256_S)
#define EFUSE_KM_XTS_KEY_LENGTH_256_V  0x00000001U
#define EFUSE_KM_XTS_KEY_LENGTH_256_S  25
/** EFUSE_LOCK_KM_KEY : RO; bitpos: [26]; default: 0;
 *  Represents whether the keys in the Key Manager are locked after deployment.\\0: Not
 *  locked\\1: Locked\\
 */
#define EFUSE_LOCK_KM_KEY    (BIT(26))
#define EFUSE_LOCK_KM_KEY_M  (EFUSE_LOCK_KM_KEY_V << EFUSE_LOCK_KM_KEY_S)
#define EFUSE_LOCK_KM_KEY_V  0x00000001U
#define EFUSE_LOCK_KM_KEY_S  26
/** EFUSE_FLASH_TPUW : RO; bitpos: [29:27]; default: 0;
 *  Represents the flash waiting time after power-up, in unit of ms. When the value
 *  less than 15, the waiting time is the programmed value. Otherwise, the waiting time
 *  is 2 times the programmed value.
 */
#define EFUSE_FLASH_TPUW    0x00000007U
#define EFUSE_FLASH_TPUW_M  (EFUSE_FLASH_TPUW_V << EFUSE_FLASH_TPUW_S)
#define EFUSE_FLASH_TPUW_V  0x00000007U
#define EFUSE_FLASH_TPUW_S  27
/** EFUSE_RD_RESERVE_0_126 : RW; bitpos: [30]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_126    (BIT(30))
#define EFUSE_RD_RESERVE_0_126_M  (EFUSE_RD_RESERVE_0_126_V << EFUSE_RD_RESERVE_0_126_S)
#define EFUSE_RD_RESERVE_0_126_V  0x00000001U
#define EFUSE_RD_RESERVE_0_126_S  30
/** EFUSE_DIS_DOWNLOAD_MODE : RO; bitpos: [31]; default: 0;
 *  Represents whether Download mode is disabled or enabled.\\ 1: disabled\\ 0:
 *  enabled\\
 */
#define EFUSE_DIS_DOWNLOAD_MODE    (BIT(31))
#define EFUSE_DIS_DOWNLOAD_MODE_M  (EFUSE_DIS_DOWNLOAD_MODE_V << EFUSE_DIS_DOWNLOAD_MODE_S)
#define EFUSE_DIS_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_DOWNLOAD_MODE_S  31

/** EFUSE_RD_REPEAT_DATA3_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA3_REG (DR_REG_EFUSE_BASE + 0x3c)
/** EFUSE_DIS_DIRECT_BOOT : RO; bitpos: [0]; default: 0;
 *  Represents whether direct boot mode is disabled or enabled.\\ 1: disabled\\ 0:
 *  enabled\\
 */
#define EFUSE_DIS_DIRECT_BOOT    (BIT(0))
#define EFUSE_DIS_DIRECT_BOOT_M  (EFUSE_DIS_DIRECT_BOOT_V << EFUSE_DIS_DIRECT_BOOT_S)
#define EFUSE_DIS_DIRECT_BOOT_V  0x00000001U
#define EFUSE_DIS_DIRECT_BOOT_S  0
/** EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT : RO; bitpos: [1]; default: 0;
 *  Represents whether print from USB-Serial-JTAG is disabled or enabled.\\ 1:
 *  disabled\\ 0: enabled\\
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT    (BIT(1))
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_M  (EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V << EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT_S  1
/** EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE : RO; bitpos: [2]; default: 0;
 *  Represents whether the USB-Serial-JTAG download function is disabled or enabled.\\
 *  1: Disable\\ 0: Enable\\
 */
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE    (BIT(2))
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_M  (EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V << EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S)
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_V  0x00000001U
#define EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_S  2
/** EFUSE_ENABLE_SECURITY_DOWNLOAD : RO; bitpos: [3]; default: 0;
 *  Represents whether security download is enabled or disabled.\\ 1: enabled\\ 0:
 *  disabled\\
 */
#define EFUSE_ENABLE_SECURITY_DOWNLOAD    (BIT(3))
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_M  (EFUSE_ENABLE_SECURITY_DOWNLOAD_V << EFUSE_ENABLE_SECURITY_DOWNLOAD_S)
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_V  0x00000001U
#define EFUSE_ENABLE_SECURITY_DOWNLOAD_S  3
/** EFUSE_UART_PRINT_CONTROL : RO; bitpos: [5:4]; default: 0;
 *  Represents the type of UART printing.\\ 00: force enable printing\\ 01: enable
 *  printing when GPIO8 is reset at low level\\ 10: enable printing when GPIO8 is reset
 *  at high level\\ 11: force disable printing\\
 */
#define EFUSE_UART_PRINT_CONTROL    0x00000003U
#define EFUSE_UART_PRINT_CONTROL_M  (EFUSE_UART_PRINT_CONTROL_V << EFUSE_UART_PRINT_CONTROL_S)
#define EFUSE_UART_PRINT_CONTROL_V  0x00000003U
#define EFUSE_UART_PRINT_CONTROL_S  4
/** EFUSE_FORCE_SEND_RESUME : RO; bitpos: [6]; default: 0;
 *  Represents whether ROM code is forced to send a resume command during SPI boot.\\
 *  1: forced\\ 0:not forced\\
 */
#define EFUSE_FORCE_SEND_RESUME    (BIT(6))
#define EFUSE_FORCE_SEND_RESUME_M  (EFUSE_FORCE_SEND_RESUME_V << EFUSE_FORCE_SEND_RESUME_S)
#define EFUSE_FORCE_SEND_RESUME_V  0x00000001U
#define EFUSE_FORCE_SEND_RESUME_S  6
/** EFUSE_SECURE_VERSION : RO; bitpos: [22:7]; default: 0;
 *  Represents the version used by ESP-IDF anti-rollback feature.
 */
#define EFUSE_SECURE_VERSION    0x0000FFFFU
#define EFUSE_SECURE_VERSION_M  (EFUSE_SECURE_VERSION_V << EFUSE_SECURE_VERSION_S)
#define EFUSE_SECURE_VERSION_V  0x0000FFFFU
#define EFUSE_SECURE_VERSION_S  7
/** EFUSE_HUK_GEN_STATE : RO; bitpos: [27:23]; default: 0;
 *  Represents whether the HUK generate mode is valid.\\Odd count of bits with a value
 *  of 1: Invalid\\Even count of bits with a value of 1: Valid\\
 */
#define EFUSE_HUK_GEN_STATE    0x0000001FU
#define EFUSE_HUK_GEN_STATE_M  (EFUSE_HUK_GEN_STATE_V << EFUSE_HUK_GEN_STATE_S)
#define EFUSE_HUK_GEN_STATE_V  0x0000001FU
#define EFUSE_HUK_GEN_STATE_S  23
/** EFUSE_FLASH_LDO_EFUSE_SEL : RO; bitpos: [28]; default: 0;
 *  Represents whether to select efuse control flash ldo default voltage. \\ 1 : efuse
 *  0 : strapping
 */
#define EFUSE_FLASH_LDO_EFUSE_SEL    (BIT(28))
#define EFUSE_FLASH_LDO_EFUSE_SEL_M  (EFUSE_FLASH_LDO_EFUSE_SEL_V << EFUSE_FLASH_LDO_EFUSE_SEL_S)
#define EFUSE_FLASH_LDO_EFUSE_SEL_V  0x00000001U
#define EFUSE_FLASH_LDO_EFUSE_SEL_S  28
/** EFUSE_RD_RESERVE_0_157 : RW; bitpos: [31:29]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_157    0x00000007U
#define EFUSE_RD_RESERVE_0_157_M  (EFUSE_RD_RESERVE_0_157_V << EFUSE_RD_RESERVE_0_157_S)
#define EFUSE_RD_RESERVE_0_157_V  0x00000007U
#define EFUSE_RD_RESERVE_0_157_S  29

/** EFUSE_RD_REPEAT_DATA4_REG register
 *  Represents rd_repeat_data
 */
#define EFUSE_RD_REPEAT_DATA4_REG (DR_REG_EFUSE_BASE + 0x40)
/** EFUSE_USB_DREFH : RO; bitpos: [1:0]; default: 0;
 *  Represents the single-end input threshold vrefh of USB_SERIAL_JTAG PHY, 1.76 V to 2
 *  V with step of 80 mV.
 */
#define EFUSE_USB_DREFH    0x00000003U
#define EFUSE_USB_DREFH_M  (EFUSE_USB_DREFH_V << EFUSE_USB_DREFH_S)
#define EFUSE_USB_DREFH_V  0x00000003U
#define EFUSE_USB_DREFH_S  0
/** EFUSE_USB_DREFL : RO; bitpos: [3:2]; default: 0;
 *  Represents the single-end input threshold vrefl of USB_SERIAL_JTAG PHY, 1.76 V to 2
 *  V with step of 80 mV.
 */
#define EFUSE_USB_DREFL    0x00000003U
#define EFUSE_USB_DREFL_M  (EFUSE_USB_DREFL_V << EFUSE_USB_DREFL_S)
#define EFUSE_USB_DREFL_V  0x00000003U
#define EFUSE_USB_DREFL_S  2
/** EFUSE_USB_OTG_FS_DREFH : RO; bitpos: [5:4]; default: 0;
 *  Represents the single-end input threshold vrefh of USB_OTG_FS PHY, 1.76 V to 2 V
 *  with step of 80 mV.
 */
#define EFUSE_USB_OTG_FS_DREFH    0x00000003U
#define EFUSE_USB_OTG_FS_DREFH_M  (EFUSE_USB_OTG_FS_DREFH_V << EFUSE_USB_OTG_FS_DREFH_S)
#define EFUSE_USB_OTG_FS_DREFH_V  0x00000003U
#define EFUSE_USB_OTG_FS_DREFH_S  4
/** EFUSE_USB_OTG_FS_DREFL : RO; bitpos: [7:6]; default: 0;
 *  Represents the single-end input threshold vrefl of USB_OTG_FS PHY, 1.76 V to 2 V
 *  with step of 80 mV.
 */
#define EFUSE_USB_OTG_FS_DREFL    0x00000003U
#define EFUSE_USB_OTG_FS_DREFL_M  (EFUSE_USB_OTG_FS_DREFL_V << EFUSE_USB_OTG_FS_DREFL_S)
#define EFUSE_USB_OTG_FS_DREFL_V  0x00000003U
#define EFUSE_USB_OTG_FS_DREFL_S  6
/** EFUSE_USB_EXCHG_PINS : RO; bitpos: [8]; default: 0;
 *  Represents whether the D+ and D- pins of USB_SERIAL_JTAG PHY is exchanged.\\ 1:
 *  exchanged\\ 0: not exchanged\\
 */
#define EFUSE_USB_EXCHG_PINS    (BIT(8))
#define EFUSE_USB_EXCHG_PINS_M  (EFUSE_USB_EXCHG_PINS_V << EFUSE_USB_EXCHG_PINS_S)
#define EFUSE_USB_EXCHG_PINS_V  0x00000001U
#define EFUSE_USB_EXCHG_PINS_S  8
/** EFUSE_USB_OTG_FS_EXCHG_PINS : RO; bitpos: [9]; default: 0;
 *  Represents whether the D+ and D- pins of USB_OTG_FS PHY is exchanged.\\ 1:
 *  exchanged\\ 0: not exchanged\\
 */
#define EFUSE_USB_OTG_FS_EXCHG_PINS    (BIT(9))
#define EFUSE_USB_OTG_FS_EXCHG_PINS_M  (EFUSE_USB_OTG_FS_EXCHG_PINS_V << EFUSE_USB_OTG_FS_EXCHG_PINS_S)
#define EFUSE_USB_OTG_FS_EXCHG_PINS_V  0x00000001U
#define EFUSE_USB_OTG_FS_EXCHG_PINS_S  9
/** EFUSE_USB_PHY_SEL : RO; bitpos: [10]; default: 0;
 *  Represents whether to exchange the USB_SERIAL_JTAG PHY with USB_OTG_FS PHY. \\ 1:
 *  exchanged. \\ 0: not exchanged.
 */
#define EFUSE_USB_PHY_SEL    (BIT(10))
#define EFUSE_USB_PHY_SEL_M  (EFUSE_USB_PHY_SEL_V << EFUSE_USB_PHY_SEL_S)
#define EFUSE_USB_PHY_SEL_V  0x00000001U
#define EFUSE_USB_PHY_SEL_S  10
/** EFUSE_SOFT_DIS_JTAG : RO; bitpos: [13:11]; default: 0;
 *  Represents whether JTAG is disabled in soft way.\\ Odd number: disabled\\ Even
 *  number: enabled\\
 */
#define EFUSE_SOFT_DIS_JTAG    0x00000007U
#define EFUSE_SOFT_DIS_JTAG_M  (EFUSE_SOFT_DIS_JTAG_V << EFUSE_SOFT_DIS_JTAG_S)
#define EFUSE_SOFT_DIS_JTAG_V  0x00000007U
#define EFUSE_SOFT_DIS_JTAG_S  11
/** EFUSE_IO_LDO_ADJUST : RO; bitpos: [21:14]; default: 0;
 *  Represents configuration of IO LDO mode and voltage.\\
 */
#define EFUSE_IO_LDO_ADJUST    0x000000FFU
#define EFUSE_IO_LDO_ADJUST_M  (EFUSE_IO_LDO_ADJUST_V << EFUSE_IO_LDO_ADJUST_S)
#define EFUSE_IO_LDO_ADJUST_V  0x000000FFU
#define EFUSE_IO_LDO_ADJUST_S  14
/** EFUSE_IO_LDO_1P8 : RO; bitpos: [22]; default: 0;
 *  Represents select IO LDO voltage to 1.8V or 3.3V.\\ 1: 1.8V\\ 0: 3.3V\\
 */
#define EFUSE_IO_LDO_1P8    (BIT(22))
#define EFUSE_IO_LDO_1P8_M  (EFUSE_IO_LDO_1P8_V << EFUSE_IO_LDO_1P8_S)
#define EFUSE_IO_LDO_1P8_V  0x00000001U
#define EFUSE_IO_LDO_1P8_S  22
/** EFUSE_DCDC_CCM_EN : RO; bitpos: [23]; default: 0;
 *  Represents whether change DCDC to CCM mode
 */
#define EFUSE_DCDC_CCM_EN    (BIT(23))
#define EFUSE_DCDC_CCM_EN_M  (EFUSE_DCDC_CCM_EN_V << EFUSE_DCDC_CCM_EN_S)
#define EFUSE_DCDC_CCM_EN_V  0x00000001U
#define EFUSE_DCDC_CCM_EN_S  23
/** EFUSE_RD_RESERVE_0_184 : RW; bitpos: [31:24]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_184    0x000000FFU
#define EFUSE_RD_RESERVE_0_184_M  (EFUSE_RD_RESERVE_0_184_V << EFUSE_RD_RESERVE_0_184_S)
#define EFUSE_RD_RESERVE_0_184_V  0x000000FFU
#define EFUSE_RD_RESERVE_0_184_S  24

