espressif/esp-idf/components/soc/esp32h4/register/soc/efuse_reg.h
/** EFUSE_RD_MAC_SYS0_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS0_REG (DR_REG_EFUSE_BASE + 0x44)
/** EFUSE_MAC_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents MAC address. Low 32-bit.
 */
#define EFUSE_MAC_0    0xFFFFFFFFU
#define EFUSE_MAC_0_M  (EFUSE_MAC_0_V << EFUSE_MAC_0_S)
#define EFUSE_MAC_0_V  0xFFFFFFFFU
#define EFUSE_MAC_0_S  0

/** EFUSE_RD_MAC_SYS1_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS1_REG (DR_REG_EFUSE_BASE + 0x48)
/** EFUSE_MAC_1 : RO; bitpos: [15:0]; default: 0;
 *  Represents MAC address. High 16-bit.
 */
#define EFUSE_MAC_1    0x0000FFFFU
#define EFUSE_MAC_1_M  (EFUSE_MAC_1_V << EFUSE_MAC_1_S)
#define EFUSE_MAC_1_V  0x0000FFFFU
#define EFUSE_MAC_1_S  0
/** EFUSE_MAC_EXT : RO; bitpos: [31:16]; default: 0;
 *  Represents the extended bits of MAC address.
 */
#define EFUSE_MAC_EXT    0x0000FFFFU
#define EFUSE_MAC_EXT_M  (EFUSE_MAC_EXT_V << EFUSE_MAC_EXT_S)
#define EFUSE_MAC_EXT_V  0x0000FFFFU
#define EFUSE_MAC_EXT_S  16

/** EFUSE_RD_MAC_SYS2_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS2_REG (DR_REG_EFUSE_BASE + 0x4c)
/** EFUSE_PVT_LIMIT : RO; bitpos: [15:0]; default: 0;
 *  Power glitch monitor threthold.
 */
#define EFUSE_PVT_LIMIT    0x0000FFFFU
#define EFUSE_PVT_LIMIT_M  (EFUSE_PVT_LIMIT_V << EFUSE_PVT_LIMIT_S)
#define EFUSE_PVT_LIMIT_V  0x0000FFFFU
#define EFUSE_PVT_LIMIT_S  0
/** EFUSE_PVT_CELL_SELECT : RO; bitpos: [22:16]; default: 0;
 *  Power glitch monitor PVT cell select.
 */
#define EFUSE_PVT_CELL_SELECT    0x0000007FU
#define EFUSE_PVT_CELL_SELECT_M  (EFUSE_PVT_CELL_SELECT_V << EFUSE_PVT_CELL_SELECT_S)
#define EFUSE_PVT_CELL_SELECT_V  0x0000007FU
#define EFUSE_PVT_CELL_SELECT_S  16
/** EFUSE_PVT_PUMP_LIMIT : RO; bitpos: [30:23]; default: 0;
 *  Use to configure voltage monitor limit for charge pump
 */
#define EFUSE_PVT_PUMP_LIMIT    0x000000FFU
#define EFUSE_PVT_PUMP_LIMIT_M  (EFUSE_PVT_PUMP_LIMIT_V << EFUSE_PVT_PUMP_LIMIT_S)
#define EFUSE_PVT_PUMP_LIMIT_V  0x000000FFU
#define EFUSE_PVT_PUMP_LIMIT_S  23
/** EFUSE_RD_RESERVE_1_95 : RW; bitpos: [31]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_1_95    (BIT(31))
#define EFUSE_RD_RESERVE_1_95_M  (EFUSE_RD_RESERVE_1_95_V << EFUSE_RD_RESERVE_1_95_S)
#define EFUSE_RD_RESERVE_1_95_V  0x00000001U
#define EFUSE_RD_RESERVE_1_95_S  31

/** EFUSE_RD_MAC_SYS3_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS3_REG (DR_REG_EFUSE_BASE + 0x50)
/** EFUSE_PUMP_DRV : RO; bitpos: [3:0]; default: 0;
 *  Use to configure charge pump voltage gain
 */
#define EFUSE_PUMP_DRV    0x0000000FU
#define EFUSE_PUMP_DRV_M  (EFUSE_PUMP_DRV_V << EFUSE_PUMP_DRV_S)
#define EFUSE_PUMP_DRV_V  0x0000000FU
#define EFUSE_PUMP_DRV_S  0
/** EFUSE_WDT_DELAY_SEL : RO; bitpos: [5:4]; default: 0;
 *  Represents the threshold level of the RTC watchdog STG0 timeout.\\ 0: Original
 *  threshold configuration value of STG0 *2 \\1: Original threshold configuration
 *  value of STG0 *4 \\2: Original threshold configuration value of STG0 *8 \\3:
 *  Original threshold configuration value of STG0 *16 \\
 */
#define EFUSE_WDT_DELAY_SEL    0x00000003U
#define EFUSE_WDT_DELAY_SEL_M  (EFUSE_WDT_DELAY_SEL_V << EFUSE_WDT_DELAY_SEL_S)
#define EFUSE_WDT_DELAY_SEL_V  0x00000003U
#define EFUSE_WDT_DELAY_SEL_S  4
/** EFUSE_HYS_EN_PAD : RO; bitpos: [6]; default: 0;
 *  Represents whether the hysteresis function of corresponding PAD is enabled.\\ 1:
 *  enabled\\ 0:disabled\\
 */
#define EFUSE_HYS_EN_PAD    (BIT(6))
#define EFUSE_HYS_EN_PAD_M  (EFUSE_HYS_EN_PAD_V << EFUSE_HYS_EN_PAD_S)
#define EFUSE_HYS_EN_PAD_V  0x00000001U
#define EFUSE_HYS_EN_PAD_S  6
/** EFUSE_PVT_GLITCH_CHARGE_RESET : RO; bitpos: [7]; default: 0;
 *  Represents whether to trigger reset or charge pump when PVT power glitch
 *  happened.\\1:Trigger charge pump. \\0:Trigger reset
 */
#define EFUSE_PVT_GLITCH_CHARGE_RESET    (BIT(7))
#define EFUSE_PVT_GLITCH_CHARGE_RESET_M  (EFUSE_PVT_GLITCH_CHARGE_RESET_V << EFUSE_PVT_GLITCH_CHARGE_RESET_S)
#define EFUSE_PVT_GLITCH_CHARGE_RESET_V  0x00000001U
#define EFUSE_PVT_GLITCH_CHARGE_RESET_S  7
/** EFUSE_RD_RESERVE_1_104 : RW; bitpos: [8]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_1_104    (BIT(8))
#define EFUSE_RD_RESERVE_1_104_M  (EFUSE_RD_RESERVE_1_104_V << EFUSE_RD_RESERVE_1_104_S)
#define EFUSE_RD_RESERVE_1_104_V  0x00000001U
#define EFUSE_RD_RESERVE_1_104_S  8
/** EFUSE_VDD_SPI_LDO_ADJUST : RO; bitpos: [16:9]; default: 0;
 *  Represents configuration of FLASH LDO mode and voltage.\\
 */
#define EFUSE_VDD_SPI_LDO_ADJUST    0x000000FFU
#define EFUSE_VDD_SPI_LDO_ADJUST_M  (EFUSE_VDD_SPI_LDO_ADJUST_V << EFUSE_VDD_SPI_LDO_ADJUST_S)
#define EFUSE_VDD_SPI_LDO_ADJUST_V  0x000000FFU
#define EFUSE_VDD_SPI_LDO_ADJUST_S  9
/** EFUSE_FLASH_LDO_POWER_SEL : RO; bitpos: [17]; default: 0;
 *  Represents which flash ldo be select:\\ 1: FLASH LDO 1P2\\ 0 : FLASH LDO 1P8\\
 */
#define EFUSE_FLASH_LDO_POWER_SEL    (BIT(17))
#define EFUSE_FLASH_LDO_POWER_SEL_M  (EFUSE_FLASH_LDO_POWER_SEL_V << EFUSE_FLASH_LDO_POWER_SEL_S)
#define EFUSE_FLASH_LDO_POWER_SEL_V  0x00000001U
#define EFUSE_FLASH_LDO_POWER_SEL_S  17
/** EFUSE_WAFER_VERSION_MINOR : R; bitpos: [21:18]; default: 0;
 *  Minor chip version
 */
#define EFUSE_WAFER_VERSION_MINOR    0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_M  (EFUSE_WAFER_VERSION_MINOR_V << EFUSE_WAFER_VERSION_MINOR_S)
#define EFUSE_WAFER_VERSION_MINOR_V  0x0000000FU
#define EFUSE_WAFER_VERSION_MINOR_S  18
/** EFUSE_WAFER_VERSION_MAJOR : R; bitpos: [23:22]; default: 0;
 *  Major chip version
 */
#define EFUSE_WAFER_VERSION_MAJOR    0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_M  (EFUSE_WAFER_VERSION_MAJOR_V << EFUSE_WAFER_VERSION_MAJOR_S)
#define EFUSE_WAFER_VERSION_MAJOR_V  0x00000003U
#define EFUSE_WAFER_VERSION_MAJOR_S  22
/** EFUSE_DISABLE_WAFER_VERSION_MAJOR : R; bitpos: [24]; default: 0;
 *  Disables check of wafer version major
 */
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR    (BIT(24))
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_M  (EFUSE_DISABLE_WAFER_VERSION_MAJOR_V << EFUSE_DISABLE_WAFER_VERSION_MAJOR_S)
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_V  0x00000001U
#define EFUSE_DISABLE_WAFER_VERSION_MAJOR_S  24
/** EFUSE_DISABLE_BLK_VERSION_MAJOR : R; bitpos: [25]; default: 0;
 *  Disables check of blk version major
 */
#define EFUSE_DISABLE_BLK_VERSION_MAJOR    (BIT(25))
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_M  (EFUSE_DISABLE_BLK_VERSION_MAJOR_V << EFUSE_DISABLE_BLK_VERSION_MAJOR_S)
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_V  0x00000001U
#define EFUSE_DISABLE_BLK_VERSION_MAJOR_S  25
/** EFUSE_BLK_VERSION_MINOR : R; bitpos: [28:26]; default: 0;
 *  BLK_VERSION_MINOR of BLOCK2
 */
#define EFUSE_BLK_VERSION_MINOR    0x00000007U
#define EFUSE_BLK_VERSION_MINOR_M  (EFUSE_BLK_VERSION_MINOR_V << EFUSE_BLK_VERSION_MINOR_S)
#define EFUSE_BLK_VERSION_MINOR_V  0x00000007U
#define EFUSE_BLK_VERSION_MINOR_S  26
/** EFUSE_BLK_VERSION_MAJOR : R; bitpos: [30:29]; default: 0;
 *  BLK_VERSION_MAJOR of BLOCK2
 */
#define EFUSE_BLK_VERSION_MAJOR    0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_M  (EFUSE_BLK_VERSION_MAJOR_V << EFUSE_BLK_VERSION_MAJOR_S)
#define EFUSE_BLK_VERSION_MAJOR_V  0x00000003U
#define EFUSE_BLK_VERSION_MAJOR_S  29
/** EFUSE_FLASH_CAP : R; bitpos: [31]; default: 0;
 *  Flash capacity
 */
#define EFUSE_FLASH_CAP    (BIT(31))
#define EFUSE_FLASH_CAP_M  (EFUSE_FLASH_CAP_V << EFUSE_FLASH_CAP_S)
#define EFUSE_FLASH_CAP_V  0x00000001U
#define EFUSE_FLASH_CAP_S  31

/** EFUSE_RD_MAC_SYS4_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS4_REG (DR_REG_EFUSE_BASE + 0x54)
/** EFUSE_FLASH_CAP_1 : R; bitpos: [1:0]; default: 0;
 *  Flash capacity
 */
#define EFUSE_FLASH_CAP_1    0x00000003U
#define EFUSE_FLASH_CAP_1_M  (EFUSE_FLASH_CAP_1_V << EFUSE_FLASH_CAP_1_S)
#define EFUSE_FLASH_CAP_1_V  0x00000003U
#define EFUSE_FLASH_CAP_1_S  0
/** EFUSE_FLASH_VENDOR : R; bitpos: [4:2]; default: 0;
 *  Flash vendor
 */
#define EFUSE_FLASH_VENDOR    0x00000007U
#define EFUSE_FLASH_VENDOR_M  (EFUSE_FLASH_VENDOR_V << EFUSE_FLASH_VENDOR_S)
#define EFUSE_FLASH_VENDOR_V  0x00000007U
#define EFUSE_FLASH_VENDOR_S  2
/** EFUSE_PSRAM_CAP : R; bitpos: [7:5]; default: 0;
 *  Psram capacity
 */
#define EFUSE_PSRAM_CAP    0x00000007U
#define EFUSE_PSRAM_CAP_M  (EFUSE_PSRAM_CAP_V << EFUSE_PSRAM_CAP_S)
#define EFUSE_PSRAM_CAP_V  0x00000007U
#define EFUSE_PSRAM_CAP_S  5
/** EFUSE_PSRAM_VENDOR : R; bitpos: [9:8]; default: 0;
 *  Psram vendor
 */
#define EFUSE_PSRAM_VENDOR    0x00000003U
#define EFUSE_PSRAM_VENDOR_M  (EFUSE_PSRAM_VENDOR_V << EFUSE_PSRAM_VENDOR_S)
#define EFUSE_PSRAM_VENDOR_V  0x00000003U
#define EFUSE_PSRAM_VENDOR_S  8
/** EFUSE_TEMP : R; bitpos: [11:10]; default: 0;
 *  Temp (die embedded inside)
 */
#define EFUSE_TEMP    0x00000003U
#define EFUSE_TEMP_M  (EFUSE_TEMP_V << EFUSE_TEMP_S)
#define EFUSE_TEMP_V  0x00000003U
#define EFUSE_TEMP_S  10
/** EFUSE_PKG_VERSION : R; bitpos: [14:12]; default: 0;
 *  Package version
 */
#define EFUSE_PKG_VERSION    0x00000007U
#define EFUSE_PKG_VERSION_M  (EFUSE_PKG_VERSION_V << EFUSE_PKG_VERSION_S)
#define EFUSE_PKG_VERSION_V  0x00000007U
#define EFUSE_PKG_VERSION_S  12
/** EFUSE_PVT_DBIAS : R; bitpos: [19:15]; default: 0;
 *  PVT DBIAS
 */
#define EFUSE_PVT_DBIAS    0x0000001FU
#define EFUSE_PVT_DBIAS_M  (EFUSE_PVT_DBIAS_V << EFUSE_PVT_DBIAS_S)
#define EFUSE_PVT_DBIAS_V  0x0000001FU
#define EFUSE_PVT_DBIAS_S  15
/** EFUSE_ADJUST_1V2 : R; bitpos: [23:20]; default: 0;
 *  SPI LDO adjust of 1.2v
 */
#define EFUSE_ADJUST_1V2    0x0000000FU
#define EFUSE_ADJUST_1V2_M  (EFUSE_ADJUST_1V2_V << EFUSE_ADJUST_1V2_S)
#define EFUSE_ADJUST_1V2_V  0x0000000FU
#define EFUSE_ADJUST_1V2_S  20
/** EFUSE_ADJUST_1V8 : R; bitpos: [27:24]; default: 0;
 *  SPI LDO adjust of 1.8v
 */
#define EFUSE_ADJUST_1V8    0x0000000FU
#define EFUSE_ADJUST_1V8_M  (EFUSE_ADJUST_1V8_V << EFUSE_ADJUST_1V8_S)
#define EFUSE_ADJUST_1V8_V  0x0000000FU
#define EFUSE_ADJUST_1V8_S  24
/** EFUSE_ACTIVE_DCDC_1V25 : R; bitpos: [31:28]; default: 0;
 *  DCDC-DCDC DBIAS of 1.25v
 */
#define EFUSE_ACTIVE_DCDC_1V25    0x0000000FU
#define EFUSE_ACTIVE_DCDC_1V25_M  (EFUSE_ACTIVE_DCDC_1V25_V << EFUSE_ACTIVE_DCDC_1V25_S)
#define EFUSE_ACTIVE_DCDC_1V25_V  0x0000000FU
#define EFUSE_ACTIVE_DCDC_1V25_S  28

/** EFUSE_RD_MAC_SYS5_REG register
 *  Represents rd_mac_sys
 */
#define EFUSE_RD_MAC_SYS5_REG (DR_REG_EFUSE_BASE + 0x58)
/** EFUSE_ACTIVE_DCDC_1V35 : R; bitpos: [3:0]; default: 0;
 *  DCDC-DCDC DBIAS of 1.35v
 */
#define EFUSE_ACTIVE_DCDC_1V35    0x0000000FU
#define EFUSE_ACTIVE_DCDC_1V35_M  (EFUSE_ACTIVE_DCDC_1V35_V << EFUSE_ACTIVE_DCDC_1V35_S)
#define EFUSE_ACTIVE_DCDC_1V35_V  0x0000000FU
#define EFUSE_ACTIVE_DCDC_1V35_S  0
/** EFUSE_SLP_DCDC : R; bitpos: [8:4]; default: 0;
 *  DCDC DBIAS in sleep
 */
#define EFUSE_SLP_DCDC    0x0000001FU
#define EFUSE_SLP_DCDC_M  (EFUSE_SLP_DCDC_V << EFUSE_SLP_DCDC_S)
#define EFUSE_SLP_DCDC_V  0x0000001FU
#define EFUSE_SLP_DCDC_S  4
/** EFUSE_LSLP_HP_DRVB : R; bitpos: [13:9]; default: 0;
 *  HP DRVB in light sleep
 */
#define EFUSE_LSLP_HP_DRVB    0x0000001FU
#define EFUSE_LSLP_HP_DRVB_M  (EFUSE_LSLP_HP_DRVB_V << EFUSE_LSLP_HP_DRVB_S)
#define EFUSE_LSLP_HP_DRVB_V  0x0000001FU
#define EFUSE_LSLP_HP_DRVB_S  9
/** EFUSE_DSLP_LP_DBIAS : R; bitpos: [15:14]; default: 0;
 *  LP DBIAS in deep sleep
 */
#define EFUSE_DSLP_LP_DBIAS    0x00000003U
#define EFUSE_DSLP_LP_DBIAS_M  (EFUSE_DSLP_LP_DBIAS_V << EFUSE_DSLP_LP_DBIAS_S)
#define EFUSE_DSLP_LP_DBIAS_V  0x00000003U
#define EFUSE_DSLP_LP_DBIAS_S  14
/** EFUSE_TEMP_CALIB : R; bitpos: [25:16]; default: 0;
 *  Temperature calibration data
 */
#define EFUSE_TEMP_CALIB    0x000003FFU
#define EFUSE_TEMP_CALIB_M  (EFUSE_TEMP_CALIB_V << EFUSE_TEMP_CALIB_S)
#define EFUSE_TEMP_CALIB_V  0x000003FFU
#define EFUSE_TEMP_CALIB_S  16
/** EFUSE_RESERVED_1_186 : R; bitpos: [31:26]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_1_186    0x0000003FU
#define EFUSE_RESERVED_1_186_M  (EFUSE_RESERVED_1_186_V << EFUSE_RESERVED_1_186_S)
#define EFUSE_RESERVED_1_186_V  0x0000003FU
#define EFUSE_RESERVED_1_186_S  26

/** EFUSE_RD_SYS_PART1_DATA0_REG register
 *  Represents rd_sys_part1_data0
 */
#define EFUSE_RD_SYS_PART1_DATA0_REG (DR_REG_EFUSE_BASE + 0x5c)
/** EFUSE_OPTIONAL_UNIQUE_ID : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_M  (EFUSE_OPTIONAL_UNIQUE_ID_V << EFUSE_OPTIONAL_UNIQUE_ID_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_S  0

/** EFUSE_RD_SYS_PART1_DATA1_REG register
 *  Represents rd_sys_part1_data1
 */
#define EFUSE_RD_SYS_PART1_DATA1_REG (DR_REG_EFUSE_BASE + 0x60)
/** EFUSE_OPTIONAL_UNIQUE_ID_1 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_1    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_M  (EFUSE_OPTIONAL_UNIQUE_ID_1_V << EFUSE_OPTIONAL_UNIQUE_ID_1_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_1_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_S  0

/** EFUSE_RD_SYS_PART1_DATA2_REG register
 *  Represents rd_sys_part1_data2
 */
#define EFUSE_RD_SYS_PART1_DATA2_REG (DR_REG_EFUSE_BASE + 0x64)
/** EFUSE_OPTIONAL_UNIQUE_ID_2 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_2    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_M  (EFUSE_OPTIONAL_UNIQUE_ID_2_V << EFUSE_OPTIONAL_UNIQUE_ID_2_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_2_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_S  0

