espressif/esp-idf/components/soc/esp32h4/register/soc/efuse_reg.h
/** EFUSE_RD_SYS_PART1_DATA3_REG register
 *  Represents rd_sys_part1_data3
 */
#define EFUSE_RD_SYS_PART1_DATA3_REG (DR_REG_EFUSE_BASE + 0x68)
/** EFUSE_OPTIONAL_UNIQUE_ID_3 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_3    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_M  (EFUSE_OPTIONAL_UNIQUE_ID_3_V << EFUSE_OPTIONAL_UNIQUE_ID_3_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_3_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_S  0

/** EFUSE_RD_SYS_PART1_DATA4_REG register
 *  Represents rd_sys_part1_data4
 */
#define EFUSE_RD_SYS_PART1_DATA4_REG (DR_REG_EFUSE_BASE + 0x6c)
/** EFUSE_OCODE : R; bitpos: [7:0]; default: 0;
 *  ADC OCode
 */
#define EFUSE_OCODE    0x000000FFU
#define EFUSE_OCODE_M  (EFUSE_OCODE_V << EFUSE_OCODE_S)
#define EFUSE_OCODE_V  0x000000FFU
#define EFUSE_OCODE_S  0
/** EFUSE_DCDC_OCODE : R; bitpos: [15:8]; default: 0;
 *  DCDC OCode
 */
#define EFUSE_DCDC_OCODE    0x000000FFU
#define EFUSE_DCDC_OCODE_M  (EFUSE_DCDC_OCODE_V << EFUSE_DCDC_OCODE_S)
#define EFUSE_DCDC_OCODE_V  0x000000FFU
#define EFUSE_DCDC_OCODE_S  8
/** EFUSE_VDD_3V4_DOUT : R; bitpos: [25:16]; default: 0;
 *  ADC dout of vdd 3.4v
 */
#define EFUSE_VDD_3V4_DOUT    0x000003FFU
#define EFUSE_VDD_3V4_DOUT_M  (EFUSE_VDD_3V4_DOUT_V << EFUSE_VDD_3V4_DOUT_S)
#define EFUSE_VDD_3V4_DOUT_V  0x000003FFU
#define EFUSE_VDD_3V4_DOUT_S  16
/** EFUSE_ADC1_AVE_INITCODE_ATTEN0 : R; bitpos: [31:26]; default: 0;
 *  Average initcode of ADC1 atten0
 */
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0    0x0000003FU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_M  (EFUSE_ADC1_AVE_INITCODE_ATTEN0_V << EFUSE_ADC1_AVE_INITCODE_ATTEN0_S)
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_V  0x0000003FU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_S  26

/** EFUSE_RD_SYS_PART1_DATA5_REG register
 *  Represents rd_sys_part1_data5
 */
#define EFUSE_RD_SYS_PART1_DATA5_REG (DR_REG_EFUSE_BASE + 0x70)
/** EFUSE_ADC1_AVE_INITCODE_ATTEN0_1 : R; bitpos: [2:0]; default: 0;
 *  Average initcode of ADC1 atten0
 */
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_1    0x00000007U
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_1_M  (EFUSE_ADC1_AVE_INITCODE_ATTEN0_1_V << EFUSE_ADC1_AVE_INITCODE_ATTEN0_1_S)
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_1_V  0x00000007U
#define EFUSE_ADC1_AVE_INITCODE_ATTEN0_1_S  0
/** EFUSE_ADC1_AVE_INITCODE_ATTEN1 : R; bitpos: [11:3]; default: 0;
 *  Average initcode of ADC1 atten1
 */
#define EFUSE_ADC1_AVE_INITCODE_ATTEN1    0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN1_M  (EFUSE_ADC1_AVE_INITCODE_ATTEN1_V << EFUSE_ADC1_AVE_INITCODE_ATTEN1_S)
#define EFUSE_ADC1_AVE_INITCODE_ATTEN1_V  0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN1_S  3
/** EFUSE_ADC1_AVE_INITCODE_ATTEN2 : R; bitpos: [20:12]; default: 0;
 *  Average initcode of ADC1 atten2
 */
#define EFUSE_ADC1_AVE_INITCODE_ATTEN2    0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN2_M  (EFUSE_ADC1_AVE_INITCODE_ATTEN2_V << EFUSE_ADC1_AVE_INITCODE_ATTEN2_S)
#define EFUSE_ADC1_AVE_INITCODE_ATTEN2_V  0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN2_S  12
/** EFUSE_ADC1_AVE_INITCODE_ATTEN3 : R; bitpos: [29:21]; default: 0;
 *  Average initcode of ADC1 atten3
 */
#define EFUSE_ADC1_AVE_INITCODE_ATTEN3    0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN3_M  (EFUSE_ADC1_AVE_INITCODE_ATTEN3_V << EFUSE_ADC1_AVE_INITCODE_ATTEN3_S)
#define EFUSE_ADC1_AVE_INITCODE_ATTEN3_V  0x000001FFU
#define EFUSE_ADC1_AVE_INITCODE_ATTEN3_S  21
/** EFUSE_ADC1_HI_DOUT_ATTEN0 : R; bitpos: [31:30]; default: 0;
 *  HI dout of ADC1 atten0
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN0    0x00000003U
#define EFUSE_ADC1_HI_DOUT_ATTEN0_M  (EFUSE_ADC1_HI_DOUT_ATTEN0_V << EFUSE_ADC1_HI_DOUT_ATTEN0_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN0_V  0x00000003U
#define EFUSE_ADC1_HI_DOUT_ATTEN0_S  30

/** EFUSE_RD_SYS_PART1_DATA6_REG register
 *  Represents rd_sys_part1_data6
 */
#define EFUSE_RD_SYS_PART1_DATA6_REG (DR_REG_EFUSE_BASE + 0x74)
/** EFUSE_ADC1_HI_DOUT_ATTEN0_1 : R; bitpos: [6:0]; default: 0;
 *  HI dout of ADC1 atten0
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN0_1    0x0000007FU
#define EFUSE_ADC1_HI_DOUT_ATTEN0_1_M  (EFUSE_ADC1_HI_DOUT_ATTEN0_1_V << EFUSE_ADC1_HI_DOUT_ATTEN0_1_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN0_1_V  0x0000007FU
#define EFUSE_ADC1_HI_DOUT_ATTEN0_1_S  0
/** EFUSE_ADC1_HI_DOUT_ATTEN1 : R; bitpos: [15:7]; default: 0;
 *  HI dout of ADC1 atten1
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN1    0x000001FFU
#define EFUSE_ADC1_HI_DOUT_ATTEN1_M  (EFUSE_ADC1_HI_DOUT_ATTEN1_V << EFUSE_ADC1_HI_DOUT_ATTEN1_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN1_V  0x000001FFU
#define EFUSE_ADC1_HI_DOUT_ATTEN1_S  7
/** EFUSE_ADC1_HI_DOUT_ATTEN2 : R; bitpos: [24:16]; default: 0;
 *  HI dout of ADC1 atten2
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN2    0x000001FFU
#define EFUSE_ADC1_HI_DOUT_ATTEN2_M  (EFUSE_ADC1_HI_DOUT_ATTEN2_V << EFUSE_ADC1_HI_DOUT_ATTEN2_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN2_V  0x000001FFU
#define EFUSE_ADC1_HI_DOUT_ATTEN2_S  16
/** EFUSE_ADC1_HI_DOUT_ATTEN3 : R; bitpos: [31:25]; default: 0;
 *  HI dout of ADC1 atten3
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN3    0x0000007FU
#define EFUSE_ADC1_HI_DOUT_ATTEN3_M  (EFUSE_ADC1_HI_DOUT_ATTEN3_V << EFUSE_ADC1_HI_DOUT_ATTEN3_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN3_V  0x0000007FU
#define EFUSE_ADC1_HI_DOUT_ATTEN3_S  25

/** EFUSE_RD_SYS_PART1_DATA7_REG register
 *  Represents rd_sys_part1_data7
 */
#define EFUSE_RD_SYS_PART1_DATA7_REG (DR_REG_EFUSE_BASE + 0x78)
/** EFUSE_ADC1_HI_DOUT_ATTEN3_1 : R; bitpos: [1:0]; default: 0;
 *  HI dout of ADC1 atten3
 */
#define EFUSE_ADC1_HI_DOUT_ATTEN3_1    0x00000003U
#define EFUSE_ADC1_HI_DOUT_ATTEN3_1_M  (EFUSE_ADC1_HI_DOUT_ATTEN3_1_V << EFUSE_ADC1_HI_DOUT_ATTEN3_1_S)
#define EFUSE_ADC1_HI_DOUT_ATTEN3_1_V  0x00000003U
#define EFUSE_ADC1_HI_DOUT_ATTEN3_1_S  0
/** EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF : R; bitpos: [4:2]; default: 0;
 *  Gap between ADC1 CH0 and average initcode
 */
#define EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF    0x00000007U
#define EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF_M  (EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF_V << EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF_S)
#define EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF_V  0x00000007U
#define EFUSE_ADC1_CH0_ATTEN0_INITCODE_DIFF_S  2
/** EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF : R; bitpos: [7:5]; default: 0;
 *  Gap between ADC1 CH1 and average initcode
 */
#define EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF    0x00000007U
#define EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF_M  (EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF_V << EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF_S)
#define EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF_V  0x00000007U
#define EFUSE_ADC1_CH1_ATTEN0_INITCODE_DIFF_S  5
/** EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF : R; bitpos: [10:8]; default: 0;
 *  Gap between ADC1 CH2 and average initcode
 */
#define EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF    0x00000007U
#define EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF_M  (EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF_V << EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF_S)
#define EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF_V  0x00000007U
#define EFUSE_ADC1_CH2_ATTEN0_INITCODE_DIFF_S  8
/** EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF : R; bitpos: [13:11]; default: 0;
 *  Gap between ADC1 CH3 and average initcode
 */
#define EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF    0x00000007U
#define EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF_M  (EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF_V << EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF_S)
#define EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF_V  0x00000007U
#define EFUSE_ADC1_CH3_ATTEN0_INITCODE_DIFF_S  11
/** EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF : R; bitpos: [16:14]; default: 0;
 *  Gap between ADC1 CH4 and average initcode
 */
#define EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF    0x00000007U
#define EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF_M  (EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF_V << EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF_S)
#define EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF_V  0x00000007U
#define EFUSE_ADC1_CH4_ATTEN0_INITCODE_DIFF_S  14
/** EFUSE_INITCODE_DIFF_1P8_3P3 : R; bitpos: [21:17]; default: 0;
 *  Initcode diff between IO LDO 1.8v and 3.3v
 */
#define EFUSE_INITCODE_DIFF_1P8_3P3    0x0000001FU
#define EFUSE_INITCODE_DIFF_1P8_3P3_M  (EFUSE_INITCODE_DIFF_1P8_3P3_V << EFUSE_INITCODE_DIFF_1P8_3P3_S)
#define EFUSE_INITCODE_DIFF_1P8_3P3_V  0x0000001FU
#define EFUSE_INITCODE_DIFF_1P8_3P3_S  17
/** EFUSE_HI_DOUT_DIFF_1P8_3P3 : R; bitpos: [26:22]; default: 0;
 *  HI dout diff between IO LDO 1.8v and 3.3v
 */
#define EFUSE_HI_DOUT_DIFF_1P8_3P3    0x0000001FU
#define EFUSE_HI_DOUT_DIFF_1P8_3P3_M  (EFUSE_HI_DOUT_DIFF_1P8_3P3_V << EFUSE_HI_DOUT_DIFF_1P8_3P3_S)
#define EFUSE_HI_DOUT_DIFF_1P8_3P3_V  0x0000001FU
#define EFUSE_HI_DOUT_DIFF_1P8_3P3_S  22
/** EFUSE_RESERVED_2_251 : R; bitpos: [31:27]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_2_251    0x0000001FU
#define EFUSE_RESERVED_2_251_M  (EFUSE_RESERVED_2_251_V << EFUSE_RESERVED_2_251_S)
#define EFUSE_RESERVED_2_251_V  0x0000001FU
#define EFUSE_RESERVED_2_251_S  27

/** EFUSE_RD_USR_DATA0_REG register
 *  Represents rd_usr_data0
 */
#define EFUSE_RD_USR_DATA0_REG (DR_REG_EFUSE_BASE + 0x7c)
/** EFUSE_USR_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the zeroth 32-bit of block3 (user).
 */
#define EFUSE_USR_DATA0    0xFFFFFFFFU
#define EFUSE_USR_DATA0_M  (EFUSE_USR_DATA0_V << EFUSE_USR_DATA0_S)
#define EFUSE_USR_DATA0_V  0xFFFFFFFFU
#define EFUSE_USR_DATA0_S  0

/** EFUSE_RD_USR_DATA1_REG register
 *  Represents rd_usr_data1
 */
#define EFUSE_RD_USR_DATA1_REG (DR_REG_EFUSE_BASE + 0x80)
/** EFUSE_USR_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the zeroth 32-bit of block3 (user).
 */
#define EFUSE_USR_DATA1    0xFFFFFFFFU
#define EFUSE_USR_DATA1_M  (EFUSE_USR_DATA1_V << EFUSE_USR_DATA1_S)
#define EFUSE_USR_DATA1_V  0xFFFFFFFFU
#define EFUSE_USR_DATA1_S  0

/** EFUSE_RD_USR_DATA2_REG register
 *  Represents rd_usr_data2
 */
#define EFUSE_RD_USR_DATA2_REG (DR_REG_EFUSE_BASE + 0x84)
/** EFUSE_USR_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the zeroth 32-bit of block3 (user).
 */
#define EFUSE_USR_DATA2    0xFFFFFFFFU
#define EFUSE_USR_DATA2_M  (EFUSE_USR_DATA2_V << EFUSE_USR_DATA2_S)
#define EFUSE_USR_DATA2_V  0xFFFFFFFFU
#define EFUSE_USR_DATA2_S  0

